Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ПредопределенныеНастройкиПодсистемы/SUI_ПредопределенныеНастройкиПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ПредопределенныеНастройкиПодсистемы</name>
  <enumValues>
    <name>УправлениеТорговлей11</name>
  </enumValues>
  <enumValues>
    <name>УправлениеНашейФирмой</name>
  </enumValues>
  <enumValues>
    <name>Розница30</name>
  </enumValues>
  <enumValues>
    <name>Розница23</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНастройкиВыборЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыгрузкаНастроек", Истина);
		
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект);
	
	SUI_НастройкиДокументовКлиент.ЗагрузитьНастройки(ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенной(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПредопределеннойНастройкойПослеВыбора", 
		ЭтотОбъект, Новый Структура("Форма", ЭтотОбъект));
		
	НастройкКД = Новый НастройкиКомпоновкиДанных;

	//ЭлементОтбора = НастройкКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//   ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23");
	
	ПараметрыВыбора = Новый Структура;
    ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкКД);
	
	ОткрытьФорму("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.ФормаВыбора", ПараметрыВыбора,,,,,ОповещениеОЗавершении);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПредопределеннойНастройкойПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		НастройкиИзМакета = ПолучитьОбщийМакетВыбранногоТипа(Результат);
		
		Если НастройкиИзМакета = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		РезультатЗагрузки = SUI_НастройкиДокументовВызовСервера.ПолучитьСписокНастроекИзФайлаПредопределенная(НастройкиИзМакета, Истина);
		
		Если Не РезультатЗагрузки.Свойство("АдресНастроек") Тогда
			
			Если РезультатЗагрузки.Свойство("Ошибка") Тогда
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|%1'"), РезультатЗагрузки.Ошибка));
			Иначе
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|Во время загрузки настроек документов %1 возникла ошибка.'"), SUI_SimpleКлиентСервер.Представление()));
			КонецЕсли;
			Возврат;
		КонецЕсли;
		  
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбраныНастройкиИзФайлаЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресНастроек", РезультатЗагрузки.АдресНастроек);
		ПараметрыОткрытия.Вставить("ПерезаписыватьСуществующие", Истина);
		 
		ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбщийМакетВыбранногоТипа(Результат)
	
	НастройкиИзМакета = Неопределено;
	
	Если Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеТорговлей11Документы"));  
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеНашейФирмойДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница30Документы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.ЕРП") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеЕРПДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.КомплекснаяАвтоматизация") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеКАДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Бухгалтерия") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеБухгалтерияДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница23Документы"));
	КонецЕсли; 
	
	Возврат НастройкиИзМакета;
	
КонецФункции 

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Свойство("АдресНастроек") Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбраныНастройкиИзФайлаЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресНастроек", Результат.АдресНастроек);
		ПараметрыОткрытия.Вставить("ПерезаписыватьСуществующие", Результат.ПерезаписыватьСуществующие);
		 
		ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиЗавершение", ЭтотОбъект);
	
		SUI_НастройкиДокументовКлиент.ЗаписатьВыбранныеНастройкиЗавершение(ОповещениеОЗавершении, Результат);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		SUI_НастройкиДокументовКлиент.ВыгрузитьНастройки(,Результат.МассивИтоговый);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
